In [1]:
import pandas as pd

In [2]:
data = {
    "Name": ["Amina", "Dias", "Aruzhan", "Timur", "Aiho"],
    "Age":  [19, 21, 20, 22, 19],
    "Score":[88, 75, 91, 84, 95]
}

df = pd.DataFrame(data)
df

      Name  Age  Score
0    Amina   19     88
1     Dias   21     75
2  Aruzhan   20     91
3    Timur   22     84
4     Aiho   19     95

In [3]:
df.head(3)

      Name  Age  Score
0    Amina   19     88
1     Dias   21     75
2  Aruzhan   20     91

In [4]:
df.describe()

            Age      Score
count   5.00000   5.000000
mean   20.20000  86.600000
std     1.30384   7.635444
min    19.00000  75.000000
25%    19.00000  84.000000
50%    20.00000  88.000000
75%    21.00000  91.000000
max    22.00000  95.000000

In [5]:
avg_score = df["Score"].mean()
avg_score

np.float64(86.6)

In [6]:
older_than_20 = df[df["Age"] > 20]
older_than_20

    Name  Age  Score
1   Dias   21     75
3  Timur   22     84

In [7]:
score_above_80 = df[df["Score"] > 80]
score_above_80

      Name  Age  Score
0    Amina   19     88
2  Aruzhan   20     91
3    Timur   22     84
4     Aiho   19     95